<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=5, minimum-scale=1">
    <meta name="msvalidate.01" content="B5163518CBE4A854B63801277FE5E35C" />
    <meta name="google-site-verification" content="ucqagxjVuq0lJZeLKs0F5AppzK111lNt3IoxU6mzlJE" />
    <meta name="robots" content="index, follow" />
    <meta name="googlebot" content="index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1" />
    <meta name="bingbot" content="index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1" />

    <meta property="og:locale" content="en_US" />
    <meta property="og:type" content="article" />

<script>(function(w,d,s,l,i){w[l]=w[l]||[];w[l].push({'gtm.start':new Date().getTime(),event:'gtm.js'});var f=d.getElementsByTagName(s)[0],j=d.createElement(s),dl=l!='dataLayer'?'&l='+l:'';j.async=true;j.src='https://www.googletagmanager.com/gtm.js?id='+i+dl;f.parentNode.insertBefore(j,f);})(window,document,'script','dataLayer','GTM-WK23PSS');</script>
<!-- Hotjar Tracking Code for staging -->
<script>
    (function(h,o,t,j,a,r){
        h.hj=h.hj||function(){(h.hj.q=h.hj.q||[]).push(arguments)};
        h._hjSettings={hjid:3587741,hjsv:6};
        a=o.getElementsByTagName('head')[0];
        r=o.createElement('script');r.async=1;
        r.src=t+h._hjSettings.hjid+j+h._hjSettings.hjsv;
        a.appendChild(r);
    })(window,document,'https://static.hotjar.com/c/hotjar-','.js?sv=');
</script>
<!-- End Hotjar Tracking code -->
    <title>Untitled - Network Management Graph Example</title>
    <link rel="canonical" href="https://neo4j.com/neo4j-graph-examples-network-management/1/network-management/">
<link rel="stylesheet" href="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/bundle.css" />
<link rel="stylesheet" href="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/utilities.min.css" />

    <link rel="preload" href="../../../assets/fonts/fontawesome-webfont.woff2?v=4.7.0" as="font">
    <link rel="stylesheet" href="../../../assets/css/site.css">
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Public+Sans:wght@300;400;500;600;700&display=swap" rel="stylesheet">

    <link rel="shortcut icon" href="https://neo4j.com/wp-content/themes/neo4jweb/favicon.ico" />



    <meta property="neo:type" content="Developer Guide">
    <meta property="neo:site" content="Developer Site">


    <meta property="og:site_name" content="Neo4j Graph Data Platform" />
    <meta property="article:publisher" content="https://www.facebook.com/neo4j.graph.database" />
    <meta name="twitter:card" content="summary_large_image" />
    <meta name="twitter:creator" content="@neo4j" />
    <meta name="twitter:site" content="@neo4j" />
    <meta property="og:type" content="article" />
    <meta property="og:title" content=" - Network Management Graph Example" />
    <meta property="og:locale" content="en_US" />
    <meta property="og:image" content="https://dist.neo4j.com/wp-content/uploads/20210423062553/neo4j-social-share-21.png" />
    <meta property="og:description" content=" - Network Management Graph Example" />
    <meta property="og:url" content="https://neo4j.com/neo4j-graph-examples-network-management/1/network-management/" />
    <link rel="shortcut icon" href="https://neo4j.com/wp-content/themes/neo4jweb/favicon.ico" />
  </head>
  <body class="article developer">
<!-- Google Tag Manager (noscript) -->
<noscript><iframe src="https://www.googletagmanager.com/ns.html?id=GTM-WK23PSS"
height="0" width="0" style="display:none;visibility:hidden"></iframe></noscript>
<!-- End Google Tag Manager (noscript) -->
<header class="header">
  <nav class="navbar">
    <div class="navbar-brand">
      <a class="navbar-item" href="/">

      <img class="navbar-logo" src="_/img/Logo_White_RGB_TransBG.svg" alt="" />
      <a href="/developer/" class="navbar-item no-left-padding page-name-white" aria-label="Developer Guides">
        Developer
      </a>
      
      </div>

      <button class="navbar-search search-button" data-target="topbar-nav" id="search_open_mobile" aria-label="Open Search">
        <svg width="23px" height="23px" viewBox="0 0 23 23" version="1.1" class="fill-current float-right" id="searchx" role="button" title="Search Website">
          <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" stroke-linecap="round"
            stroke-linejoin="round">
            <g transform="translate(-2.000000, -2.000000)" stroke="#a0aec0" stroke-width="1.5">
              <circle
                transform="translate(11.389364, 11.388564) rotate(-23.025000) translate(-11.389364, -11.388564) "
                cx="11.3893642" cy="11.3885639" r="8.056"></circle>
              <path d="M17.0853333,17.0844444 L23.3333333,23.3333333" ></path>
            </g>
          </g>
        </svg>
      </button>
      <button class="navbar-burger" data-target="topbar-nav" aria-label="Mobile Navigation Button">
        <span></span>
        <span></span>
        <span></span>
      </button>
    </div>
    <div id="topbar-nav" class="navbar-menu">
            <div class="navbar-end">


        <div class="navbar-item has-dropdown is-hoverable docs">
          <a class="navbar-link" href="/docs/">Docs</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <span class="project-name">Neo4j DBMS</span>
              <ul class="project-links">
                <li><a href="/docs/getting-started/current/" class="project-link">Getting Started</a></li>
                <li><a href="/docs/operations-manual/current/" class="project-link">Operations</a></li>
                <li><a href="/docs/migration-guide/current/" class="project-link">Migration and Upgrade</a></li>
                <li><a href="/docs/status-codes/current/" class="project-link">Status Codes</a></li>
                <li><a href="/docs/java-reference/current/" class="project-link">Java Reference</a></li>
                <li><a href="/docs/kerberos-add-on/current/" class="project-link">Kerberos Add-on</a></li>
                <li><a href="/docs/cdc/current/" class="project-link">Change Data Capture (CDC)</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <a class="project-name" href="/docs/aura/">Neo4j Aura</a>
              <ul class="project-links">
                <li><a class="project-link" href="/docs/aura">Neo4j Aura</a></li>
                <li><a class="project-link" href="/docs/aura/auradb/">Neo4j AuraDB</a></li>
                <li><a class="project-link" href="/docs/aura/aurads/">Neo4j AuraDS</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Neo4j Tools</span>
              <ul class="project-links">
                <li><a href="/docs/bloom-user-guide/current/" class="project-link">Neo4j Bloom</a></li>
                <li><a href="/docs/browser-manual/current/" class="project-link">Neo4j Browser</a></li>
                <li><a href="/docs/data-importer/current/" class="project-link">Neo4j Data Importer</a></li>
                <li><a href="/docs/desktop-manual/current/" class="project-link">Neo4j Desktop</a></li>
                <li><a href="/docs/ops-manager/current/" class="project-link">Neo4j Ops Manager</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Neo4j Graph Data Science</span>
              <ul class="project-links">
                <li><a href="/docs/graph-data-science/current/" class="project-link">Neo4j Graph Data Science Library</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Cypher Query Language</span>
              <ul class="project-links">
                <li><a href="/docs/cypher-manual/current/" class="project-link">Cypher</a></li>
                <li><a href="/docs/cypher-cheat-sheet/current/" class="project-link">Cypher Cheat Sheet</a></li>
                <li><a href="/docs/apoc/current/" class="project-link">APOC Library</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name" href="/docs/drivers-apis">Create applications</span>
              <ul class="project-links">
                <li><a href="/docs/python-manual/current/" class="project-link">Python Driver</a></li>
                <li><a href="/docs/go-manual/current/" class="project-link">Go Driver</a></li>
                <li><a href="/docs/java-manual/current/" class="project-link">Java Driver</a></li>
                <li><a href="/docs/javascript-manual/current/" class="project-link">JavaScript Driver</a></li>
                <li><a href="/docs/dotnet-manual/current/" class="project-link">.Net Driver</a></li>
                <li><a href="/docs/graphql-manual/current/" class="project-link">Neo4j GraphQL Library</a></li>
                <li><a href="/docs/http-api/current/" class="project-link">HTTP API</a></li>
                <li><a href="/docs/ogm-manual/current/" class="project-link">OGM Library</a></li>
                <li><a href="https://docs.spring.io/spring-data/neo4j/docs/current/reference/html/#reference" class="project-link">Spring Data Neo4j</a></li>
                <li><a href="/docs/spark/" class="project-link">Neo4j Connector for Apache Spark</a></li>
                <li><a href="/docs/kafka/" class="project-link">Neo4j Connector for Apache Kafka</a></li>
              </ul>
            </div>

          </div>
        </div>
        <div class="navbar-item has-dropdown is-hoverable labs">
          <a class="navbar-link" href="/labs/">Labs</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <a class="project-name" href="/labs/arrows/">arrows.app</a>
              <ul class="project-links">
                <li><a href="/labs/arrows/" class="project-link">Details</a></li>
                <li><a href="https://arrows.app" class="project-link">arrows.app</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/apoc/">APOC Extended</a>

              <ul class="project-links">
                <li><a href="/labs/apoc/5/" class="project-link">Documentation</a></li>
                <li><a href="/developer/neo4j-apoc/" class="project-link">Developer Guide</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/halin/">Halin</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/etl-tool/">ETL Tool</a>
              <ul class="project-links">
                <li><a href="/labs/etl-tool/" class="project-link">Details</a></li>
                <li><a href="/labs/etl-tool/1.5.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neo4j-migrations/">Neo4j Migrations</a>
              <ul class="project-links">
                <li><a href="/labs/neo4j-migrations/" class="project-link">Details</a></li>
                <li><a href="/labs/neo4j-migrations/2.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/liquibase/">Neo4j Plugin For Liquibase</a>
              <ul class="project-links">
                <li><a href="/labs/liquibase/" class="project-link">Details</a></li>
                <li><a href="https://github.com/liquibase/liquibase-neo4j" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neosemantics/">Neosemantics</a>
              <ul class="project-links">
                <li><a href="/labs/neosemantics/tutorial/" class="project-link">Getting Started</a></li>
                <li><a href="/labs/neosemantics/4.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neo4j-helm/">Neo4j Helm</a>
              <ul class="project-links">
                <li><a href="/labs/neo4j-helm/" class="project-link">Details</a></li>
                <li><a href="/labs/neo4j-helm/1.0.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neodash/">NeoDash</a>
              <ul class="project-links">
                <li><a href="/labs/neodash/" class="project-link">Details</a></li>
                <li><a href="/labs/neodash/2.1/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neomodel/">neomodel</a>
              <ul class="project-links">
                <li><a href="/labs/neomodel/" class="project-link">Details</a></li>
                <li><a href="https://neomodel.readthedocs.io/en/latest/" target="_blank" class="project-link">Documentation</a></li>
              </ul>
            </div>
          </div>
        </div>
        <div class="navbar-item has-dropdown is-hoverable developer">
          <a class="navbar-link" href="/developer/resources/">Get Help</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <a class="project-name" href="https://graphacademy.neo4j.com/?ref=docs" target="_blank">GraphAcademy</a>
              <ul class="project-links">
                <li><a class="project-link" href="https://graphacademy.neo4j.com/?ref=docs">Free, Self Paced Training</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/certification/?ref=docs" target="_blank">Certification</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <a class="project-name" href="https://dev.neo4j.com/forum" target="_blank">Community Forum</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://dev.neo4j.com/chat" target="_blank">Discord Chat</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/developer/kb" target="_blank">Knowledge Base</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://medium.com/neo4j" target="_blank">Neo4j Developer Blog</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://www.youtube.com/neo4j" target="_blank">Neo4j Videos</a>
            </div>
          </div>
        </div>
        <div class="navbar-item is-hoverable getting-started-cta">
          <a class="navbar-link primary" href="https://neo4j.com/cloud/platform/aura-graph-database/?ref=docs-nav-get-started">Get Started Free</a>
        </div>
        <div class="navbar-item">
          <a class="navbar-link search-button" href="#search" id="search_open"><svg width="23px" height="23px" viewBox="0 0 23 23"
              version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"
              class="fill-current float-right" id="search" role="button" title="Search Website">
              <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" stroke-linecap="round"
                stroke-linejoin="round">
                <g transform="translate(-2.000000, -2.000000)" stroke="#a0aec0" stroke-width="1.5">
                  <circle
                    transform="translate(11.389364, 11.388564) rotate(-23.025000) translate(-11.389364, -11.388564) "
                    cx="11.3893642" cy="11.3885639" r="8.056"></circle>
                  <path d="M17.0853333,17.0844444 L23.3333333,23.3333333" ></path>
                </g>
              </g>
            </svg><span class="navbar-mobile">Search</span></a>
        </div>
      </div>
    </div>
  </nav>
</header>
<div class="body">
<div class="nav-container" data-component="neo4j-graph-examples-network-management" data-version="1">
  <aside class="nav">
    <div class="panels">
      <div class="selectors">
        
      </div>
              <div class="feedback" style="height: var(--feedback-height);">
    <div class="header question">
        <p><strong>Is this page helpful?</strong></p>

        <svg width="22px" height="22px" viewBox="0 0 22 22" role="button" class="no" aria-label="No, this page isn't helpful">
            <path
                d="M6.25,15.8333333 C6.25,13.7622655 7.92893219,12.0833333 10,12.0833333 C12.0710678,12.0833333 13.75,13.7622655 13.75,15.8333333"
                ></path>
            <circle  cx="10" cy="10" r="9.58333333"></circle>
            <path
                d="M12.5,4.58333333 C12.8934466,4.05873783 13.5109223,3.75 14.1666667,3.75 C14.822411,3.75 15.4398867,4.05873783 15.8333333,4.58333333"
                ></path>
            <line x1="4.58333333" y1="7.91666667" x2="7.08333333" y2="7.91666667" ></line>
            <path
                d="M7.08333333,8.54166667 C6.96827401,8.54166667 6.875,8.44839266 6.875,8.33333333 C6.875,8.21827401 6.96827401,8.125 7.08333333,8.125 C7.19839266,8.125 7.29166667,8.21827401 7.29166667,8.33333333 C7.29166667,8.44839266 7.19839266,8.54166667 7.08333333,8.54166667"
                ></path>
            <line x1="12.9166667" y1="7.91666667" x2="15.4166667" y2="7.91666667" ></line>
            <path
                d="M15.4166667,8.54166667 C15.3016073,8.54166667 15.2083333,8.44839266 15.2083333,8.33333333 C15.2083333,8.21827401 15.3016073,8.125 15.4166667,8.125 C15.531726,8.125 15.625,8.21827401 15.625,8.33333333 C15.625,8.44839266 15.531726,8.54166667 15.4166667,8.54166667"
                ></path>
            <path
                d="M4.16666667,4.58333333 C4.5601133,4.05873783 5.17758895,3.75 5.83333333,3.75 C6.48907772,3.75 7.10655337,4.05873783 7.5,4.58333333"
                ></path>
        </svg>

        <svg width="22px" height="22px" viewBox="0 0 22 22" role="button" class="yes" aria-label="Yes, this page is helpful">
            <circle  cx="10" cy="10" r="9.58333333"></circle>
            <path
                d="M5.41666667,8.125 C5.53172599,8.125 5.625,8.21827401 5.625,8.33333333 C5.625,8.44839266 5.53172599,8.54166667 5.41666667,8.54166667 C5.30160734,8.54166667 5.20833333,8.44839266 5.20833333,8.33333333 C5.20833333,8.21827401 5.30160734,8.125 5.41666667,8.125"
                ></path>
            <path
                d="M14.5833333,8.125 C14.468274,8.125 14.375,8.21827401 14.375,8.33333333 C14.375,8.44839266 14.468274,8.54166667 14.5833333,8.54166667 C14.6983927,8.54166667 14.7916667,8.44839266 14.7916667,8.33333333 C14.7916667,8.21827401 14.6983927,8.125 14.5833333,8.125"
                ></path>
            <path
                d="M13.2275,12.9166657 C13.4853075,12.9162808 13.7287776,13.035241 13.8869095,13.2388563 C14.0450415,13.4424715 14.1000278,13.7078123 14.0358333,13.9575 C13.562901,15.7999679 11.9021969,17.0882321 10,17.0882321 C8.09780311,17.0882321 6.43709903,15.7999679 5.96416667,13.9575 C5.89997223,13.7078123 5.95495852,13.4424715 6.11309045,13.2388563 C6.27122239,13.035241 6.51469246,12.9162808 6.7725,12.9166657 L13.2275,12.9166657 Z"
                ></path>
        </svg>
    </div>


</div>
    </div>
  </aside>
</div>
<main class="article">
<div class="toolbar" role="navigation">
  <div class="toolbar-wrapper">
    <button class="nav-toggle" aria-label="Toggle Table of Contents"></button>
    <nav class="breadcrumbs" aria-label="breadcrumbs">
</nav>
        <div class="edit-this-page"><a href="https://github.com/QubitPi/neo4j-graph-examples-network-management/tree/HEAD/modules/ROOT/pages/network-management.adoc">Edit this Page</a></div>
    </div>
</div>

  <div class="content">
<article class="doc">
<div class="sect-header">
</div>





<style type="text/css">
.smallest {
   font-size:0.6em;
}
</style>
<div class="sect1">
<h2 id="_network_management_introduction"><a class="anchor" href="#_network_management_introduction"></a>Network Management - Introduction</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Computer networks span all levels of the stack from physical connections up to mobile and web-applications connecting networks of users.</p>
</div>
<div class="paragraph">
<p>Graph Databases offer a natural way of modelling, storing and querying all these types of computer networks.</p>
</div>
<div class="paragraph">
<p>A graph database like Neo4j can be utilized for:</p>
</div>
<div class="ulist">
<ul>
<li>
<p>Configuration Management</p>
</li>
<li>
<p>Impact Analysis</p>
</li>
<li>
<p>Planning</p>
</li>
<li>
<p>Security and Hardening of Networks</p>
</li>
<li>
<p>Intrusion Detection</p>
</li>
<li>
<p>Traffic Analytics</p>
</li>
<li>
<p>Analytics of user behavior</p>
</li>
</ul>
</div>
<div class="paragraph">
<p>In this example we want to look at Network Management and Impact Analysis from the level of routing (TCP/IP) upwards to managing applications and tracing their dependencies.</p>
</div>
<div class="paragraph">
<p>Throughout the guide you&#8217;ll find Cypher statements that you can execute, by clicking on them and then executing them by hitting the run button.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_modeling"><a class="anchor" href="#_modeling"></a>Modeling</h2>
<div class="sectionbody">
<div class="imageblock right unresolved">
<div class="content">
<img src="/Network-Management-Model.svg" alt="Network Management Model" width="700">
</div>
</div>
<div class="paragraph">
<p>We can model the network endpoints (boxes like servers, routers, firewalls, racks) of the data center as nodes and the "cables" between them as relationships.</p>
</div>
<div class="paragraph">
<p>Another type of node represent networks and interfaces.</p>
</div>
<div class="paragraph">
<p>On the application level we have the operating system, virtual machines, application and services that are modeled as entities.</p>
</div>
<div class="paragraph">
<p>Our example data is already set-up, in the "resources" section at the end, you&#8217;ll find some pointers there.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_datacenter"><a class="anchor" href="#_datacenter"></a>DataCenter</h2>
<div class="sectionbody">
<div class="paragraph">
<p>This is the full data model of your graph.</p>
</div>
<div class="imageblock right unresolved">
<div class="content">
<img src="/network-schema-arrows.jpg" alt="network schema arrows">
</div>
</div>
<div class="paragraph">
<p>If you want to see it yourself, run</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">call db.schema.visualization()</code></pre>
</div>
</div>
<div class="paragraph">
<p>Imagine we have a <code>DataCenter</code> connected to an Interconnect via an <code>Egress Router</code>.
The datacenter uses a <code>10.x.x.x/8</code> IP address range.</p>
</div>
<div class="paragraph">
<p>The DataCenter consists of several Zones which are connected to the main backbone each via a <code>Router</code> (10.zone.*/16).</p>
</div>
<div class="paragraph">
<p>From there each zone is broken down into rows of <code>Racks</code>.</p>
</div>
<div class="paragraph">
<p>Each <code>Rack</code> contains different types of <code>Servers</code> and has its own <code>Switch</code> to connect to the datacenter routers backplane.</p>
</div>
<div class="paragraph">
<p>Each <code>Server</code> has external network <code>Interfaces</code> that connect to the rack switch, the local networks being <code>10.zone.rack.*/24</code>.</p>
</div>
<div class="paragraph">
<p>Each machine either runs a real Operating System (<code>OS</code>) or a Virtualization Manager that runs a number of Virtual Machines.</p>
</div>
<div class="paragraph">
<p>For operational simplicity we only run one <code>Application</code> per OS which uses a number of <code>Ports</code> on the external interface.</p>
</div>
<div class="paragraph">
<p>Usually we would get this kind of information from a configuration management database (CMDB), network management tools or agents installed on the machines.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_network_exploration_datacenter_and_zones"><a class="anchor" href="#_network_exploration_datacenter_and_zones"></a>Network Exploration: DataCenter and Zones</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Let&#8217;s walk through the data, step by step. Let&#8217;s start with the DataCenter.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH network = (dc:DataCenter {name:"DC1",location:"Iceland, Rekjavik"})
             -[:CONTAINS]-&gt;(:Router)
             -[:ROUTES]-&gt;(:Interface)
RETURN network;</code></pre>
</div>
</div>
<div class="imageblock right unresolved">
<div class="content">
<img src="/network-zones.jpg" alt="network zones">
</div>
</div>
<div class="paragraph">
<p>The datacenter consists of 4 zones, each of which has its own separate <code>Network</code> <code>10.zone.*/16</code>, and it&#8217;s own <code>Router</code>.</p>
</div>
<div class="paragraph">
<p>We can draw out that verbal description in a query with patterns matching the network parts.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (dc:DataCenter {name:"DC1"})-[:CONTAINS]-&gt;(re:Router:Egress)-[:ROUTES]-&gt;(rei:Interface)

MATCH (nr:Network:Zone)&lt;-[:CONNECTS]-(rei)

// router in DC, connect it via an interface to the zone network
MATCH (dc)-[:CONTAINS]-&gt;(r:Router)-[:ROUTES]-&gt;(ri:Interface)-[:CONNECTS]-&gt;(nr)

RETURN *;</code></pre>
</div>
</div>
<div class="paragraph">
<p>To visualize the DataCenter and its components so far, we can also start at the center and then go 3 hops out.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH path = (dc:DataCenter)-[*3]-(:Network)
RETURN path;</code></pre>
</div>
</div>
<div class="paragraph">
<p>We could also get statistical information, like the addresses of routers and interfaces in each network.</p>
</div>
<div class="paragraph">
<p>You can see very well how the graph representation in the match pattern resembles our domain model.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (r:Router)-[:ROUTES]-&gt;(ri:Interface)-[:CONNECTS]-&gt;(nr:Network)
WHERE r.zone IS NOT NULL
RETURN nr.ip as network_ip, ri.ip as router_if_ip, r.name as router, r.zone as zone;</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>╒════════════╤══════════════╤═════════╤══════╕
│"network_ip"│"router_if_ip"│"router" │"zone"│
╞════════════╪══════════════╪═════════╪══════╡
│"10.1"      │"10.1.0.254"  │"DC1-R-1"│1     │
├────────────┼──────────────┼─────────┼──────┤
│"10.2"      │"10.2.0.254"  │"DC1-R-2"│2     │
├────────────┼──────────────┼─────────┼──────┤
│"10.3"      │"10.3.0.254"  │"DC1-R-3"│3     │
├────────────┼──────────────┼─────────┼──────┤
│"10.4"      │"10.4.0.254"  │"DC1-R-4"│4     │
└────────────┴──────────────┴─────────┴──────┘</pre>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_network_exploration_racks"><a class="anchor" href="#_network_exploration_racks"></a>Network Exploration: Racks</h2>
<div class="sectionbody">
<div class="imageblock right unresolved">
<div class="content">
<img src="/network-rack.jpg" alt="network rack" width="600">
</div>
</div>
<div class="paragraph">
<p>Each zone contains 10 <code>Racks</code>, each of which has it&#8217;s own <code>Switch</code> and subnet with an IP like this pattern <code>10.zone.rack.*/24</code>.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (dc:DataCenter {name:"DC1"})-[:CONTAINS]-&gt;(rack:Rack)-[:HOLDS]-&gt;(s:Switch)-[:ROUTES]-&gt;(si:Interface)&lt;-[:ROUTES]-(nr:Network:Zone)

RETURN *;</code></pre>
</div>
</div>
<div class="paragraph">
<p>Now our network has grown quite a bit:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH network = (dc:DataCenter)-[*6]-(:Rack)
RETURN network;</code></pre>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_network_connectivity"><a class="anchor" href="#_network_connectivity"></a>Network Connectivity</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Now we could already have a look at the network connectivity in our datacenter.</p>
</div>
<div class="paragraph">
<p>If we look now at the overall connections we need to use shortest-paths which represents the most efficient route.</p>
</div>
<div class="listingblock">
<div class="title">Connectivity before: 40 routes a 5 hops</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH path = allShortestPaths( (rack:Rack)-[:HOLDS|ROUTES|CONNECTS*]-(router:Router:Egress) )
RETURN length(path) as hops, count(*) as count;</code></pre>
</div>
</div>
<div class="paragraph">
<p>What happens if one of our cables gets loose or cut, i.e. the <code>ROUTES</code> relationship between the switch&#8217;s interface and the network is gone.</p>
</div>
<div class="paragraph">
<p>Let&#8217;s <strong>cut the cable</strong> of this first switch.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (:Interface {ip:"10.1.1.254"})&lt;-[rel:ROUTES]-(:Network)
DELETE rel</code></pre>
</div>
</div>
<div class="paragraph">
<p>Connectivity after: 39 routes a 5 hops</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH path = allShortestPaths( (rack:Rack)-[:HOLDS|ROUTES|CONNECTS*]-(router:Router:Egress) )
RETURN length(path) as hops, count(*) as count;</code></pre>
</div>
</div>
<div class="paragraph">
<p>Now all the machines in that Rack are cut off, no connection anymore, which we can demonstrate by trying to find the shortest path.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH connection = allShortestPaths( (rack:Rack {name:"DC1-RCK-1-1"})-[:HOLDS|ROUTES|CONNECTS*]-(router:Router:Egress) )
RETURN connection;</code></pre>
</div>
</div>
<div class="paragraph">
<p>How can we fix that?
We could connect each switch to all the other three networks too, so we would survive the loss of 3 of those 4 connections.</p>
</div>
<div class="listingblock">
<div class="title">Createing new, redundant network connections</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">// for all zones
MATCH (nr:Network:Zone)
// find *all* switches and their interface
MATCH (s:Switch)-[:ROUTES]-&gt;(si:Interface)
// connect them to all the zones, if not yet connected
MERGE (si)&lt;-[:ROUTES]-(nr);</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH path = allShortestPaths((rack:Rack)-[:HOLDS|ROUTES|CONNECTS*]-(router:Router:Egress))
RETURN length(path) as hops, count(*) as count;</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>╒══════╤═══════╕
│"hops"│"count"│
╞══════╪═══════╡
│5     │160    │
└──────┴───────┘</pre>
</div>
</div>
<div class="imageblock right unresolved">
<div class="content">
<img src="/network-alternative-routes.jpg" alt="network alternative routes">
</div>
</div>
<div class="paragraph">
<p>Cut the first cable of this first switch again.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (:Interface {ip:"10.1.1.254"})&lt;-[rel:ROUTES]-(:Network)
WITH rel LIMIT 1
DELETE rel</code></pre>
</div>
</div>
<div class="paragraph">
<p>But that Rack is now still connected with 3 alternative routes.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH path = allShortestPaths((rack:Rack {zone:1,rack:1})-[:HOLDS|ROUTES|CONNECTS*]-(router:Router:Egress))
RETURN path;</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>╒══════╤═══════╕
│"hops"│"count"│
╞══════╪═══════╡
│5     │3      │
└──────┴───────┘</pre>
</div>
</div>
<div class="paragraph">
<p>Now let&#8217;s look at the servers in those racks.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_machine_types"><a class="anchor" href="#_machine_types"></a>Machine types</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Similar to the machines you can rent on AWS we use machine types, for which we auto-created some reasonable capacities for CPU, RAM and DISK.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (t:Type)
RETURN t.name, t.id, t.cpu, t.ram, t.disk;</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>╒══════════════════╤══════╤═══════╤═══════╤════════╕
│"t.name"          │"t.id"│"t.cpu"│"t.ram"│"t.disk"│
╞══════════════════╪══════╪═══════╪═══════╪════════╡
│"xs-1/1/1"        │0     │1      │1      │1       │
├──────────────────┼──────┼───────┼───────┼────────┤
│"s-2/4/5"         │1     │2      │4      │5       │
├──────────────────┼──────┼───────┼───────┼────────┤
│"m-4/16/25"       │2     │4      │16     │25      │
├──────────────────┼──────┼───────┼───────┼────────┤
│"l-8/64/125"      │3     │8      │64     │125     │
├──────────────────┼──────┼───────┼───────┼────────┤
│"xl-16/256/625"   │4     │16     │256    │625     │
├──────────────────┼──────┼───────┼───────┼────────┤
│"xxl-32/1024/3125"│5     │32     │1024   │3125    │
└──────────────────┴──────┴───────┴───────┴────────┘</pre>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_machines"><a class="anchor" href="#_machines"></a>Machines</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Each Rack contains 200 machines of the types we just introduced, so that in total we get 8000 servers in our datacenter.</p>
</div>
<div class="paragraph">
<p>As expected, the distribution of the types is inverse to their capabilities.</p>
</div>
<div class="paragraph">
<p>As the graph visualization of our full datacenter would be pretty but otherwise useless &#8230;&#8203;</p>
</div>
<div class="imageblock unresolved">
<div class="content">
<img src="/network-8000-machines.jpg" alt="network 8000 machines">
</div>
</div>
<div class="imageblock right unresolved">
<div class="content">
<img src="/network-rack-machines-type.jpg" alt="network rack machines type" width="400">
</div>
</div>
<div class="paragraph">
<p>We&#8217;d rather look at the contents of a single rack</p>
</div>
<div class="listingblock">
<div class="title">Visualization of Rack <code>DC1-RCK-2-1</code></div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (r:Rack {name:"DC1-RCK-2-1"})-[:HOLDS]-&gt;(m:Machine),
      (m)-[:ROUTES]-&gt;(i:Interface)-[:CONNECTS]-&gt;(si)&lt;-[:ROUTES]-(s:Switch),
      (m)-[:TYPE]-&gt;(type:Type)
RETURN *</code></pre>
</div>
</div>
<div class="paragraph">
<p>or it&#8217;s stats.</p>
</div>
<div class="listingblock">
<div class="title">Contents of Rack <code>DC1-RCK-2-1</code></div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (r:Rack {name:"DC1-RCK-2-1"})-[:HOLDS]-&gt;(m:Machine),
      (m)-[:ROUTES]-&gt;(i:Interface)-[:CONNECTS]-&gt;(si)&lt;-[:ROUTES]-(s:Switch),
      (m)-[:TYPE]-&gt;(type:Type)
RETURN r.name as rack, si.ip as switchIp, properties(type) as type, count(m) as machines, min(i.ip) as minIp, max(i.ip) as maxIp
ORDER BY machines DESC;</code></pre>
</div>
</div>
<div class="listingblock smallest">
<div class="content">
<pre>╒═════════════╤════════════╤═══════════════════════════════════════════════════════════════════════════════════════╤══════════╤════════════╤════════════╕
│"rack"       │"switchIp"  │"type"                                                                                 │"machines"│"minIp"     │"maxIp"     │
╞═════════════╪════════════╪═══════════════════════════════════════════════════════════════════════════════════════╪══════════╪════════════╪════════════╡
│"DC1-RCK-2-1"│"10.2.1.254"│{"disk":"5","name":"s-2/4/5","cpu":"2","id":"1","type":"s","ram":"4"}                  │"94"      │"10.2.1.100"│"10.2.1.99" │
├─────────────┼────────────┼───────────────────────────────────────────────────────────────────────────────────────┼──────────┼────────────┼────────────┤
│"DC1-RCK-2-1"│"10.2.1.254"│{"disk":"1","name":"xs-1/1/1","cpu":"1","id":"0","type":"xs","ram":"1"}                │"52"      │"10.2.1.1"  │"10.2.1.9"  │
├─────────────┼────────────┼───────────────────────────────────────────────────────────────────────────────────────┼──────────┼────────────┼────────────┤
│"DC1-RCK-2-1"│"10.2.1.254"│{"disk":"25","name":"m-4/16/25","cpu":"4","id":"2","type":"m","ram":"16"}              │"34"      │"10.2.1.147"│"10.2.1.180"│
├─────────────┼────────────┼───────────────────────────────────────────────────────────────────────────────────────┼──────────┼────────────┼────────────┤
│"DC1-RCK-2-1"│"10.2.1.254"│{"disk":"125","name":"l-8/64/125","cpu":"8","id":"3","type":"l","ram":"64"}            │"13"      │"10.2.1.181"│"10.2.1.193"│
├─────────────┼────────────┼───────────────────────────────────────────────────────────────────────────────────────┼──────────┼────────────┼────────────┤
│"DC1-RCK-2-1"│"10.2.1.254"│{"disk":"625","name":"xl-16/256/625","cpu":"16","id":"4","type":"xl","ram":"256"}      │"5"       │"10.2.1.194"│"10.2.1.198"│
├─────────────┼────────────┼───────────────────────────────────────────────────────────────────────────────────────┼──────────┼────────────┼────────────┤
│"DC1-RCK-2-1"│"10.2.1.254"│{"disk":"3125","name":"xxl-32/1024/3125","cpu":"32","id":"5","type":"xxl","ram":"1024"}│"2"       │"10.2.1.199"│"10.2.1.200"│
└─────────────┴────────────┴───────────────────────────────────────────────────────────────────────────────────────┴──────────┴────────────┴────────────┘</pre>
</div>
</div>
<div class="paragraph">
<p>We can also query for a distribution of machine types across the datacenter.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (r:Rack)-[:HOLDS]-&gt;(m:Machine)-[:TYPE]-&gt;(type:Type)
RETURN properties(type) as type, count(*) as c
ORDER BY c DESC;</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre>╒══════════════════════════════════════════════════════════════════╤════╕
│"t"                                                               │"c" │
╞══════════════════════════════════════════════════════════════════╪════╡
│{"disk":5,"name":"s-2/4/5","cpu":2,"id":1,"ram":4}                │3760│
├──────────────────────────────────────────────────────────────────┼────┤
│{"disk":1,"name":"xs-1/1/1","cpu":1,"id":0,"ram":1}               │2080│
├──────────────────────────────────────────────────────────────────┼────┤
│{"disk":25,"name":"m-4/16/25","cpu":4,"id":2,"ram":16}            │1360│
├──────────────────────────────────────────────────────────────────┼────┤
│{"disk":125,"name":"l-8/64/125","cpu":8,"id":3,"ram":64}          │520 │
├──────────────────────────────────────────────────────────────────┼────┤
│{"disk":625,"name":"xl-16/256/625","cpu":16,"id":4,"ram":256}     │200 │
├──────────────────────────────────────────────────────────────────┼────┤
│{"disk":3125,"name":"xxl-32/1024/3125","cpu":32,"id":5,"ram":1024}│80  │
└──────────────────────────────────────────────────────────────────┴────┘</pre>
</div>
</div>
<div class="paragraph">
<p>Or if we treat our datacenter as a supercomputer, what&#8217;s the total amount of CPUs, RAM and disk available:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (m:Machine)-[:TYPE]-&gt;(type:Type)
RETURN count(*) as count, sum(type.cpu) as cpus, sum(type.ram) as ram, sum(type.disk) as disk;</code></pre>
</div>
</div>
<div class="listingblock">
<div class="title">Not bad, that&#8217;s quite some compute power.</div>
<div class="content">
<pre>╒═══════╤══════╤══════╤══════╕
│"count"│"cpus"│"ram" │"disk"│
╞═══════╪══════╪══════╪══════╡
│8000   │24960 │205280│494880│
└───────┴──────┴──────┴──────┘</pre>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_software_operating_systems_and_applications"><a class="anchor" href="#_software_operating_systems_and_applications"></a>Software: Operating Systems and Applications</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Bare-metal hardware is cool, but something has to run on it to make it useable.</p>
</div>
<div class="paragraph">
<p>Most likely it will be some kind of virtualization infrastructure that allows dynamic reallocation of the compute, memory and disk resources.</p>
</div>
<div class="paragraph">
<p>Because of the added complexity, we skip this for now.</p>
</div>
<div class="paragraph">
<p>For our software we differentiate between <code>Operating Systems, Services and Applications</code> (which could also be micro services).</p>
</div>
<div class="paragraph">
<p>Each of them has a name, version(s) and dependencies.</p>
</div>
<div class="paragraph">
<p>In  a more elaborate model we could also handle other resource requirements like RAM / CPU / DISK per running software instance.</p>
</div>
<div class="paragraph">
<p>Let&#8217;s look at our available operating systems.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (o:OS:Software)-[:VERSION]-&gt;(v)
OPTIONAL MATCH (v)&lt;-[:PREVIOUS]-(vnext)
RETURN o.name as os, v.name as version, vnext.name as next_version
ORDER BY os, version;</code></pre>
</div>
</div>
<div class="paragraph">
<p>Similar for our other software</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (s:Software) WHERE not s:OS
OPTIONAL MATCH (s)-[:VERSION]-&gt;(v)
OPTIONAL MATCH (s)-[:DEPENDS_ON]-&gt;(dv)&lt;-[:VERSION]-(d)
RETURN s.name, collect(v.name) as versions, [x IN collect([d.name,dv.name]) WHERE x[0] IS NOT NULL] as dependencies, s.ports;</code></pre>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_software_running_on_machines"><a class="anchor" href="#_software_running_on_machines"></a>Software: Running on Machines</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Each of our machines is set up to run an OS and a single application, each of which might require other dependencies that are also installed.</p>
</div>
<div class="imageblock unresolved">
<div class="content">
<img src="/network-software-arrows.jpg" alt="network software arrows">
</div>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (m:Machine) WHERE (m)-[:RUNS]-&gt;() AND rand() &lt; 0.05 WITH m LIMIT 1
MATCH (m)-[r:RUNS]-&gt;(p:Process)-[i:INSTANCE]-&gt;(sv)
OPTIONAL MATCH (sv)&lt;-[v:VERSION]-(sw)
RETURN *</code></pre>
</div>
</div>
<div class="imageblock unresolved">
<div class="content">
<img src="/network-software-machine.jpg" alt="network software machine">
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_dependency_analysis"><a class="anchor" href="#_dependency_analysis"></a>Dependency Analysis</h2>
<div class="sectionbody">
<div class="paragraph">
<p>We could look at dependencies between data center elements on the physical level, like routers, switches and interfaces.</p>
</div>
<div class="paragraph">
<p>Another way to look at it is to determine dependencies between machines based on their internal and external connections.</p>
</div>
<div class="paragraph">
<p>But we can also use the software and its dependencies to determine bottlenecks and frequently dependent upon components.</p>
</div>
<div class="paragraph">
<p>Let&#8217;s look at all the software that uses Neo4j and the running Neo4j instances.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (s)-[:DEPENDS_ON]-&gt;(nv:Version)&lt;-[:VERSION]-(n:Software:Service {name:"neo4j"})
MATCH (s)&lt;-[:INSTANCE]-(sp)&lt;-[:RUNS]-(sm:Machine)
MATCH (sp)-[DEPENDS_ON]-&gt;(np)-[:INSTANCE]-&gt;(nv)
MATCH (np)&lt;-[:RUNS]-(nm:Machine)
RETURN sm as software_machine, sp as software_process, s as software, nv as neo_version,np as neo4j_process, np as neo_machine
LIMIT 10</code></pre>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_configuration_management"><a class="anchor" href="#_configuration_management"></a>Configuration Management</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Proper IT infrastructures use a large number of configuration parameters to customize commodity hardware and software.  To manage all of the variables, Configuration Management Databases (CMDBs) are used.  Systems require certain variables, and can report what is currently configured so that the CMDB can detect issues, and send necessary updates.</p>
</div>
<div class="paragraph">
<p>In the past, CMDBs were mostly used for network, hardware and OS level configuration.  Today, their use has expanded into services to support modern architectures.  A number of related systems have popped up, such as ZooKeeper, Konsul, Eureka, and others.</p>
</div>
<div class="paragraph">
<p>Due to the variety of systems used for providing configuration to the infrastructure, it is very useful to create a unified, up to date view of the situation in your systems graph.</p>
</div>
<div class="sect2">
<h3 id="_upgrade_os_version_and_its_dependencies_for_a_version_range"><a class="anchor" href="#_upgrade_os_version_and_its_dependencies_for_a_version_range"></a>Upgrade OS Version and its Dependencies for a Version Range</h3>
<div class="paragraph">
<p>We&#8217;re looking for machines in our Graph-CMDB whose Operating systems have to be updated.
The OS versions were linked in a list of <code>:PREVIOUS</code> connections.
So we can easily determine if someone have an older than the expected version, even if version numbers are not sortable.
Those machine will be marked for an update to the correct version.</p>
</div>
<div class="listingblock">
<div class="title">Mark for update</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (os:OS:Software)-[:VERSION]-&gt;(newVersion) WHERE os.name = 'Debian' and newVersion.name = '8-Jessie'

MATCH (m:Machine)-[:RUNS]-&gt;(op:OS:Process)-[:INSTANCE]-&gt;(currentVersion)
WHERE (currentVersion)&lt;-[:PREVIOUS*]-(newVersion)

// create update request
CREATE (m)-[:UPDATE_TO {ts:timestamp()}]-&gt;(newVersion)</code></pre>
</div>
</div>
<div class="paragraph">
<p>All machines with <code>UPDATE_TO</code> requests can be found by tools and operators.</p>
</div>
<div class="listingblock">
<div class="title">Find pending updates</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (r:Rack)-[:HOLDS]-&gt;(m:Machine)-[:UPDATE_TO]-&gt;(vNew:Version)&lt;-[:VERSION]-(os:OS:Software)
MATCH (m)-[:RUNS]-&gt;(:OS:Process)-[:INSTANCE]-&gt;(vCurr)
WHERE vCurr &lt;&gt; vNew
RETURN r.name, m.name, os.name, vCurr.name as currentVersion, vNew.name as newVersion
LIMIT 100;</code></pre>
</div>
</div>
<div class="paragraph">
<p>When the local OS is physically updated, the old <code>:OS:Process</code> will be stopped and the one will run.</p>
</div>
<div class="listingblock">
<div class="title">Replace old OS instance with new</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (m:Machine)-[:UPDATE_TO]-&gt;(vNew:Version)&lt;-[:VERSION]-(os:OS:Software)
MATCH (m)-[:RUNS]-&gt;(op:OS:Process)-[:INSTANCE]-&gt;(vCurr)
WHERE vCurr &lt;&gt; vNew
CREATE (m)-[:RUNS]-&gt;(opNew:OS:Process)-[:INSTANCE]-&gt;(vNew)
DETACH DELETE op;</code></pre>
</div>
</div>
<div class="paragraph">
<p>After the physical update has been performed, the machines will report the now updated version and the update request can be removed.</p>
</div>
<div class="listingblock">
<div class="title">Remove resolved update requests</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (m:Machine)-[update:UPDATE_TO]-&gt;(v:Version)&lt;-[:VERSION]-(os:OS:Software)
WHERE (m)-[:RUNS]-&gt;(:OS:Process)-[:INSTANCE]-&gt;(v)

DELETE update;</code></pre>
</div>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_it_monitoring_and_governance"><a class="anchor" href="#_it_monitoring_and_governance"></a>IT-Monitoring and Governance</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Live network operations need to be supervised to ensure smooth operations, prevent bottlenecks, protect from attacks and vulnerabilities and allow maintenance planning and failure handling.</p>
</div>
<div class="paragraph">
<p>The information is either acquired by listening on network traffic and inferring running services and user and application activity combined with port-scans.</p>
</div>
<div class="paragraph">
<p>Alternatively, agents installed on the machines report the state of each server to the network or centralized databases which update the live state of the network.</p>
</div>
<div class="paragraph">
<p>Based on our existing model, those incoming messages and events can do the following:</p>
</div>
<div class="ulist">
<ul>
<li>
<p>Create new entries for Servers, Switches, Interfaces</p>
</li>
<li>
<p>Track running Services via used ports and traffic</p>
</li>
<li>
<p>Infer user and application activity and group by network segment, source, used service</p>
</li>
<li>
<p>Detect abnormal operations like attacks or potential bottlenecks and issue warnings</p>
</li>
<li>
<p>Track violations of rules, like isolation of the DMZ, certain firewall rules etc.</p>
</li>
</ul>
</div>
<div class="paragraph">
<p>Here is an example of a new connection coming in and the graph being updated accordingly.
Subsequent information for that connection will be aggregated until it is closed, then the totals could be added to the general <code>CONNECTIONS</code> relationship between the two IPs.</p>
</div>
<div class="paragraph">
<p>We could generate some events, by having processes from some machines accessing processes from other (random) Machines.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (m:Machine) WITH collect(m) as machines
WITH machines, size(machines) as len
UNWIND range(1,10) as idx
WITH machines[toInteger(rand()*len)] as source, machines[toInteger(rand()*len)] as target
MATCH (source)-[:ROUTES]-&gt;(si:Interface)-[:EXPOSES]-&gt;(sp:Port)&lt;-[:LISTENS]-(sourceAppProcess)-[:INSTANCE]-&gt;(sourceApp)
WITH target, source,si,head(collect(sp)) as sp, sourceAppProcess,sourceApp
// todo limit to first port
MATCH (target)-[:ROUTES]-&gt;(ti:Interface)-[:EXPOSES]-&gt;(tp:Port)&lt;-[:LISTENS]-(targetAppProcess)-[:INSTANCE]-&gt;(targetApp)
WITH source,si,sp, sourceAppProcess,sourceApp,target,ti,head(collect(tp)) as tp, targetAppProcess, targetApp
// todo limit to first port
RETURN {id: randomUUID(), type:"OpenConnection",source:{ip:si.ip, port:sp.port},target:{ip:ti.ip,port:tp.port},
        connection: {source:sourceApp.name, target:targetApp.name, user: "user"+toString(toInteger(rand()*1000))+"@"+source.name,
        time:timestamp(), packets: 1, mtu: 1500 }} as event</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">:param events:
[
{"source":{"ip":"10.1.7.100","port":11210},"id":"3e41d6f0-fdce-48f4-9bff-818359d8f0af","target":{"ip":"10.3.3.112","port":8080},
 "connection":{"source":"couchbase","target":"webapp","user":"user436@DC1-RCK-1-7-M-100","time":1490540382971},"type":"OpenConnection",
 "packets": 1, "mtu": 1500, "time": 1490904418539 },
{"source":{"ip":"10.1.4.91","port":7474},"id":"fed44be6-55f5-4e42-aab1-bebc5c818268","target":{"ip":"10.4.6.7","port":8080},
 "connection":{"source":"neo4j","target":"webapp","user":"user911@DC1-RCK-1-4-M-91","time":1490540382971},"type":"OpenConnection",
 "packets": 1, "mtu": 1500, "time": 1490904464824 }
]</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">UNWIND $events AS event
WITH event WHERE event.type = 'OpenConnection'

MERGE (si:Interface {ip:event.source.ip})
MERGE (si)-[:OPENS]-&gt;(sp:Port {port: event.source.port})

MERGE (ti:Interface {ip:event.target.ip})
MERGE (ti)-[:LISTENS]-&gt;(tp:Port {port:event.target.port})

CREATE (sp)&lt;-[:FROM]-(c:Connection {id:event.id})–[:TO]-&gt;(tp)
SET c += event.connection // type, timestamp, user-info, ...
MERGE (si)-[cstats:CONNECTIONS]-&gt;(ti)
SET si.count = coalesce(si.count,0) + 1
SET si.packets = coalesce(si.packets,0) + event.packets
SET si.volume = coalesce(si.volume,0) + event.packets * event.mtu</code></pre>
</div>
</div>
<div class="paragraph">
<p>All the information is aggregated in a live graph representation which is available for querying for alerts &amp; notifications, dashboards, inventory summaries, reports and more.</p>
</div>
<div class="paragraph">
<p>Historic information can be stored as well as a timeline chain of changes attributed to cause.
Both can be queried by operators to drill down into detailed analysis.</p>
</div>
<div class="listingblock">
<div class="title">Connections opened over a time range</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (si:Interface)-[:OPENS]-&gt;(sp:Port)&lt;-[:FROM]-(c:Connection)–[:TO]-&gt;(tp:Port)&lt;-[:LISTENS]-(ti:Interface)
WHERE c.type = 'OpenConnection'
RETURN si.ip as source, ti.ip as target, apoc.date.format(c.time,'ms','yyyy-MM-dd HH') as hour, count(distinct c) as count
ORDER BY hour ASC, count DESC
LIMIT 100;</code></pre>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_examples_for_graph_based_network_management_solutions"><a class="anchor" href="#_examples_for_graph_based_network_management_solutions"></a>Examples for graph based Network Management Solutions</h2>
<div class="sectionbody">
<div class="paragraph">
<p>A number of commercial solutions provide this kind of service, some of them are running Neo4j.</p>
</div>
<div class="paragraph">
<p>There are also open source solutions like <a href="https://github.com/LendingClub/mercator">Mercator from Lending Club</a> and the <a href="http://assimilationsystems.com/">Assimilation Project by Alan Robertson</a>.</p>
</div>
<div class="paragraph">
<p>This real-time IT inventory information is also required for due diligence, e.g. for corporate investments, mergers or acquisitions.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_monitoring_use_cases"><a class="anchor" href="#_monitoring_use_cases"></a>Monitoring Use-Cases</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Our graph contains both the static topological information and a lot of runtime information using the base topology.
From the runtime data we can retrieve different metrics.</p>
</div>
<div class="sect2">
<h3 id="_for_instance_minimal_average_and_maximal_runtimes_of_software_instances_per_type"><a class="anchor" href="#_for_instance_minimal_average_and_maximal_runtimes_of_software_instances_per_type"></a>For instance, minimal, average and maximal runtimes of software instances per type</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (v)&lt;-[:INSTANCE]-(sp:Process)&lt;-[:RUNS]-(sm:Machine)
MATCH (s:Software)-[:VERSION]-&gt;(v:Version)
WITH s.name as software, v.name as version, timestamp() - sp.startTime as runtime
RETURN software, version, count(*) as instances, { min: min(runtime), max: max(runtime), avg:avg(runtime) } as runtime</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_data_transer_volume_between_interfaces"><a class="anchor" href="#_data_transer_volume_between_interfaces"></a>Data Transer Volume between Interfaces</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH path = (source:Interface)-[con:CONNECTIONS]-&gt;(target:Interface)
RETURN source.ip, target.ip, sum(con.packets) as packets, sum(con.volume) as volume</code></pre>
</div>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_resource_management_graph"><a class="anchor" href="#_resource_management_graph"></a>Resource Management Graph</h2>
<div class="sectionbody">
<div class="paragraph">
<p>If you use a resource manager like Apaoche Mesos (or DC/OS), Kubernetes etc. you specify for each piece of software you run not just name, version and dependencies but also resource requirements like cpu, ram, disk, ports and more.</p>
</div>
<div class="paragraph">
<p>A scheduler then takes the available resources of a configured machine cluster to schedule and allocate it&#8217;s resources to the needs and numbers of the required instances of software to run.
It also takes care of health checks, and (re)starting / (re)scheduling and (re)routing of individual new or failed instances.</p>
</div>
<div class="paragraph">
<p>To model the resource graph of such a system is interesting to look at and reason about, especially if other requirements like indicated co-location or disk-reuse are taken into account.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_references"><a class="anchor" href="#_references"></a>References</h2>
<div class="sectionbody">
<div class="ulist">
<ul>
<li>
<p><a href="https://neo4j.com/use-cases/network-and-it-operations/">Neo4j Solutions: Network &amp; IT Operations</a></p>
</li>
<li>
<p><a href="https://neo4j.com/resources/network-datacenter-white-paper/">WP: Graph Databases Solve Problems in Network and Data Center Management</a></p>
</li>
<li>
<p><a href="http://assimilationsystems.com/">Assimilation Systems</a> <a href="https://neo4j.com/blog/solve-network-management-problems-with-neo4j/">Interview with Founder Alan Robertson</a></p>
</li>
<li>
<p><a href="https://neo4j.com/graphgists/?category=network-and-it-operations">Network Management GraphGists</a></p>
</li>
<li>
<p>Lending Club Engineering created a number of network management projects using Neo4j</p>
<div class="ulist">
<ul>
<li>
<p><a href="https://neo4j.com/blog/managing-microservices-neo4j/">Presentation</a>, <a href="https://www.slideshare.net/robschoening/managing-microservices-with-neo4j-53389282">Slides</a></p>
</li>
<li>
<p>MacGyver: DevOps Multi-Tool <a href="https://github.com/LendingClub?q=macgyver">Repositories</a> <a href="https://www.slideshare.net/neo4j/neo4j-for-cloud-management-at-scale">Slides</a></p>
</li>
<li>
<p>Mercator: produce graph model projections of infrastructure <a href="https://github.com/LendingClub/mercator">Repository</a></p>
</li>
</ul>
</div>
</li>
<li>
<p><a href="http://springinpractice.com/2011/12/17/domain-modeling-with-spring-data-neo4j-code">Building the Zkybase CMDB using Neo4j and Spring Data Neo4j</a></p>
</li>
<li>
<p><a href="http://lightmesh.com/">LigthMesh CMDB solution from Neo4j Partner xnlogic</a></p>
</li>
<li>
<p><a href="https://labs.vmware.com/vmtj/simplifying-virtualization-management-with-graph-databases">Article: Simplifying Virtualization Management with Graph Databases</a></p>
</li>
<li>
<p><a href="https://www.vmware.com/pdf/vi_architecture_wp.pdf">WhitePaper: VMware Infrastructure Architecture Overview</a></p>
</li>
</ul>
</div>
</div>
</div>
</article>
<aside class="toc sidebar" data-title="Contents"
  data-levels="2">
  <div class="toc-menu">
    <div class="toc-menu-placeholder"></div>

      </div>
  </aside>  </div>
</main>
</div>
<footer class="footer">
  <div class="wrapper">

  <div class="column logo">
    <div class="logo-footer"></div>
  </div>
  
  <div class="column links">
    <h2>Learn</h2>
    <ul>
      <li><i class="fa fa-wrench" aria-hidden="true"></i> <a rel="noopener" href="https://neo4j.com/sandbox/?ref=developer-footer">Sandbox</a></li>
      <li><i class="fa fa-comments-o" aria-hidden="true"></i> <a rel="noopener" href="https://community.neo4j.com?ref=developer-footer" target="_blank">Neo4j Community Site</a></li>
      <li><i class="fa fa-book" aria-hidden="true"></i> <a rel="noopener" href="https://medium.com/neo4j" target="_blank">Neo4j Developer Blog</a></li>
      <li><i class="fa fa-youtube" aria-hidden="true"></i> <a rel="noopener" href="https://www.youtube.com/neo4j" target="_blank">Neo4j Videos</a></li>
      <li><i class="fa fa-graduation-cap" aria-hidden="true"></i> <a rel="noopener" href="https://neo4j.com/graphacademy/?ref=developer-footer">GraphAcademy</a></li>
      <li><i class="fa fa-flask" aria-hidden="true"></i> <a href="https://neo4j.com/labs/?ref=developer-footer">Neo4j Labs</a></li>
    </ul>
  </div>
  <div class="column links">
    <h2>Social</h2>
    <ul>
      <li><i class="fa fa-twitter" aria-hidden="true"></i> <a rel="noopener" href="https://twitter.com/neo4j" target="_blank">Twitter</a></li>
      <li><i class="fa fa-meetup" aria-hidden="true"></i> <a rel="noopener" href="https://www.meetup.com/Neo4j-Online-Meetup/" target="_blank">Meetups</a></li>
      <li><i class="fa fa-github" aria-hidden="true"></i> <a rel="noopener" href="https://github.com/neo4j/neo4j" target="_blank">Github</a></li>
      <li><i class="fa fa-stack-overflow" aria-hidden="true"></i> <a rel="noopener" href="https://stackoverflow.com/questions/tagged/neo4j" target="_blank">Stack Overflow</a></li>

      <li class="speaker-program"><a href="https://docs.google.com/forms/d/e/1FAIpQLSdEcNnMruES5iwvOVYovmS1D_P1ZL_HdUOitFrwrvruv5PZvA/viewform">Want to Speak?</a></li>
    </ul>
  </div>
  <div class="column links">
    <h2><a href="https://neo4j.com/contact-us/?ref=footer">Contact Us →</a></h2>
    <ul>
      <li>US: 1-855-636-4532</li>
      <li>Sweden +46 171 480 113</li>
      <li>UK: +44 20 3868 3223</li>
      <li>France: +33 (0) 1 88 46 13 20</li>
    </ul>
  </div>

    <div class="column">
    <p>© <span id="footer-copyright-year">2024</span> Neo4j, Inc.<br>
      <a href="https://neo4j.com/terms/">Terms</a> | <a href="https://neo4j.com/privacy-policy/">Privacy </a> | <a href="https://neo4j.com/sitemap/">Sitemap</a></p>
    <p>Neo4j<sup>®</sup>, Neo Technology<sup>®</sup>, Cypher<sup>®</sup>, Neo4j<sup>®</sup> Bloom<sup>™</sup> and
      Neo4j<sup>®</sup> Aura<sup>™</sup> are registered trademarks
      of Neo4j, Inc. All other marks are owned by their respective companies.</p>
  </div>

  
</div>
</footer>

  <script src="../../../assets/js/vendor/auth0.js"></script>
  <script src="../../../assets/js/site.js"></script>
  <script async src="../../../assets/js/vendor/highlight.js"></script>
  <script async src="../../../assets/js/vendor/image-zoom.js"></script>


<div id="neo4j-algolia-search-v2"></div>
<script src="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/bundle.js"></script>
<script src="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/polyfill.js"></script>
<script>window.algoliaSearchOptions = {indexName: "docs",placeholder: "Search Documentation",template: "docs"}</script>  </body>
</html>
